# Pandas

#### First of all

In [2]:
import pandas as pd

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
the DataFrame is like a table with rows and columns.

In [3]:
df = pd.read_csv('titanic.csv')
df

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [4]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df.head(8)

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
5          897         0
6          898         1
7          899         0

In [5]:
df.tail()

     PassengerId  Survived
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Survived     418 non-null    int64
dtypes: int64(2)
memory usage: 6.7 KB

In [7]:
df.describe()

       PassengerId    Survived
count   418.000000  418.000000
mean   1100.500000    0.363636
std     120.810458    0.481622
min     892.000000    0.000000
25%     996.250000    0.000000
50%    1100.500000    0.000000
75%    1204.750000    1.000000
max    1309.000000    1.000000

In [8]:
df.columns

Index(['PassengerId', 'Survived'], dtype='object')

In [10]:
#wich one is null
df.isnull()

     PassengerId  Survived
0          False     False
1          False     False
2          False     False
3          False     False
4          False     False
..           ...       ...
413        False     False
414        False     False
415        False     False
416        False     False
417        False     False

[418 rows x 2 columns]

In [11]:
# How many null we have in dataset
df.isnull().sum()

PassengerId    0
Survived       0
dtype: int64

In [12]:
#values of a column

survived = df.Survived
pid = df["PassengerId"]

In [13]:
#survived peopple
df[df["Survived"] == 1]

     PassengerId  Survived
1            893         1
4            896         1
6            898         1
8            900         1
12           904         1
..           ...       ...
409         1301         1
410         1302         1
411         1303         1
412         1304         1
414         1306         1

[152 rows x 2 columns]

In [14]:
df.sort_values(by="PassengerId")

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [16]:
#Groupby on Survived 
df.groupby('Survived').count().PassengerId

Survived
0    266
1    152
Name: PassengerId, dtype: int64

In [17]:
#indexing (index location)

df.iloc[0,0]
#the value in the df[0][0] 
df.iloc[0:5, 0:2]
#       row , column

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

### Locate Row
Pandas use the loc attribute and index of element to return one specified row

In [20]:
df.loc[0]

PassengerId    892
Survived         0
Name: 0, dtype: int64

Pandas use the loc attribute and a list of index of elements to return rows

In [23]:
df.loc[[0, 1, 7, 15]]

    PassengerId  Survived
0           892         0
1           893         1
7           899         0
15          907         1

It shows from index 0 to index 5 and from column PassengerId to column Survived

In [24]:
df.loc[0:5, "PassengerId":"Survived"]

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1
5          897         0

In [25]:
#we can change index of dataframe

newdf = df.set_index('PassengerId')
print(">previous index<\n", df.head())
print("\n>new index<\n", newdf.head())

>previous index<
    PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

>new index<
              Survived
PassengerId
892                 0
893                 1
894                 0
895                 0
896                 1

In [26]:
#Locate Row
#Pandas use the loc attribute and index of element to return one specified row

newdf.loc[892]

Survived    0
Name: 892, dtype: int64

In [27]:
#Pandas use the loc attribute and a >>>list of index<<< of elements to return rows

newdf.loc[[892, 893, 894, 895]]  
newdf.loc[892:895]               #or you can use this

             Survived
PassengerId
892                 0
893                 1
894                 0
895                 0

In [29]:
#we can use lambda with pandas

newdf.loc[lambda newdf: newdf["Survived"]==1]
df.loc[lambda df: df["Survived"]==1]

     PassengerId  Survived
1            893         1
4            896         1
6            898         1
8            900         1
12           904         1
..           ...       ...
409         1301         1
410         1302         1
411         1303         1
412         1304         1
414         1306         1

[152 rows x 2 columns]

In [30]:
#it shows unique values for a column

df.Survived.unique()

array([0, 1], dtype=int64)

In [31]:
#it shows count of each unique values for a column

df.Survived.value_counts()

0    266
1    152
Name: Survived, dtype: int64

In [32]:
#by map we can use a func on a set of data

df_mean = df.Survived.mean()         #mean of survived
df.Survived.map(lambda p: p - df_mean )

0     -0.363636
1      0.636364
2     -0.363636
3     -0.363636
4      0.636364
         ...
413   -0.363636
414    0.636364
415   -0.363636
416   -0.363636
417   -0.363636
Name: Survived, Length: 418, dtype: float64

In [33]:
#How can we made a dataset?

data = {
    'name':['Ali', 'Farzad', 'Soma'], 
    'age' :[17, 18, 19], 
    'city':['Tehran', 'Isfahan', 'Kordestan']
}
#each key in dic made a column in our dataset

our_df = pd.DataFrame(data)
our_df

     name  age       city
0     Ali   17     Tehran
1  Farzad   18    Isfahan
2    Soma   19  Kordestan

In [88]:
#we can save our hand made dataset


our_df.to_csv('name_of_ourdf.csv')

### Changing columns name

In [34]:
#Changing columns name
df = pd.DataFrame({'a': [1, 2], 'b': [3, 4]})
  
# Changing columns name with index number
su = df.rename(columns={df.columns[1]: 'new'})
  
# Display
display(su)

   a  new
0  1    3
1  2    4

In [37]:
# Sample DataFrame
df = pd.DataFrame({'a': [1, 2], 'b': [3, 4], 'c': [7, 8]})
  
# Changing columns name with index number
mapping = {df.columns[0]: 'new0', df.columns[1]: 'new1'}
temp_df = df.rename(columns=mapping)
  
# Display
display(temp_df)

   new0  new1  c
0     1     3  7
1     2     4  8

In [35]:
# Sample DataFrame
df = pd.DataFrame({'a': [1, 2], 'b': [3, 4]})
  
# Changing columns name with index number
df.columns.values[0] = "b"
df.columns.values[1] = "a"
  
# Display
display(df)

   b  a
0  1  3
1  2  4